Yr8/8-CS-AI/source/assessment.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js" type="text/javascript"></script>
#+HTML_HEAD_EXTRA: <script src="js/navbar.js" type="text/javascript"></script>
#+OPTIONS: f:nil author:nil num:1 creator:nil timestamp:nil toc:nil

#+TITLE: The Digital Die
#+AUTHOR: Marc Scott

#+BEGIN_HTML
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-SC-DigitalDie">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="7_Lesson.html">Week7</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:
* Badge criteria guidance
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** MarkIt
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:
- Below guidance has been provided for the award of badges.
| <40>                                     | <40>                                     | <40>                                     | <40>                                     |
| Criteria                                 | Silver                                   | Gold                                     | Platinum                                 |
|------------------------------------------+------------------------------------------+------------------------------------------+------------------------------------------|
| What'ssssss in a name                    | Assign values to variable                | Understand some basic data types         | Perform simple calculations              |
| Slithering Sums                          | Perform simple calculations              | Perform more complex calculations using variables | Manipulate variable values               |
| Snaking out and in                       | Use simple Print statements              | Create a simple chat bot                 | Create a basic calculator                |
| =if= I see a snake - 'RUN'               | Use simple conditional selection         | Create a basic Quiz                      | Use Maths in a Quiz                      |
| =elif= it's harmless - 'relax'           | Respond to multiple user inputs          | Using comparison operators               | Create your own timetable                |
| Easting its own tail                     | Questioning within a loop                | Counting with while loops                | Create counting song lyrics              |
| When will this end?                      | Using comments in code                   | Finding Square Roots                     | The Halting Problem                      |
