Yr7/7-CS-Turing/pages/assessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Digital Die</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">The Digital Die</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-SC-DigitalDie">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Badge criteria guidance</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 document">
<h3 id="sec-1-1">MarkIt</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Below guidance has been provided for the award of badges.
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Criteria</th>
<th scope="col" class="left">Silver</th>
<th scope="col" class="left">Gold</th>
<th scope="col" class="left">Platinum</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">What'ssssss in a name</td>
<td class="left">Assign values to variable</td>
<td class="left">Understand some basic data types</td>
<td class="left">Perform simple calculations</td>
</tr>

<tr>
<td class="left">Slithering Sums</td>
<td class="left">Perform simple calculations</td>
<td class="left">Perform more complex calculations using variables</td>
<td class="left">Manipulate variable values</td>
</tr>

<tr>
<td class="left">Snaking out and in</td>
<td class="left">Use simple Print statements</td>
<td class="left">Create a simple chat bot</td>
<td class="left">Create a basic calculator</td>
</tr>

<tr>
<td class="left"><code>if</code> I see a snake - 'RUN'</td>
<td class="left">Use simple conditional selection</td>
<td class="left">Create a basic Quiz</td>
<td class="left">Use Maths in a Quiz</td>
</tr>

<tr>
<td class="left"><code>elif</code> it's harmless - 'relax'</td>
<td class="left">Respond to multiple user inputs</td>
<td class="left">Using comparison operators</td>
<td class="left">Create your own timetable</td>
</tr>

<tr>
<td class="left">Easting its own tail</td>
<td class="left">Questioning within a loop</td>
<td class="left">Counting with while loops</td>
<td class="left">Create counting song lyrics</td>
</tr>

<tr>
<td class="left">When will this end?</td>
<td class="left">Using comments in code</td>
<td class="left">Finding Square Roots</td>
<td class="left">The Halting Problem</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
